---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.UnusedTypesInTheProject
source: html/1065d4e6-23fd-a48d-0a4d-eaa096ad1036.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.UnusedTypesInTheProject Property

Project contains unused families and/or types. Consider purging them out.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnusedTypesInTheProject { get; }
```